eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
/********************************************************************************
* Copyright (c) 2010-2019 Robert Bosch GmbH
*
* This program and the accompanying materials are made available under the
* terms of the Eclipse Public License 2.0 which is available at
* http://www.eclipse.org/legal/epl-2.0.
*
* SPDX-License-Identifier: EPL-2.0
*
* Contributors:
*    Robert Bosch GmbH - initial contribution
*
********************************************************************************/

/**
 * @file
 * @brief  Implementation of Extension port BSP functions
 */

/* This is used to define the correct module ID for generation of module
 * error codes
 */
#include "BCDS_BSP.h"
#undef BCDS_MODULE_ID
#define BCDS_MODULE_ID BCDS_BSP_MODULE_ID_EXTENSION_PORT

#include "BCDS_HAL.h"
#if BCDS_FEATURE_BSP_EXTENSIONPORT

#include "BSP_ExtensionPort.h"
#include "BspExtensionPort.h"
#include "BSP_BoardExtSettings.h"
#include "BSP_BoardShared.h"
#include "BCDS_MCU_I2C_Handle.h"
#include "em_i2c.h"
#include "BCDS_MCU_SPI_Handle.h"
#include "BCDS_MCU_DMA_Handle.h"
#include "BCDS_MCU_UART_Handle.h"
#include "em_usart.h"
#include "BCDS_MCU_UART.h"

/* Put the type and macro definitions here */

/* Put constant and variable definitions here */

/* Handle instance for I2C driver */
static struct MCU_I2C_Handle_S Bsp_ExtensionPortI2cInstance;

static struct MCU_I2C_Handle_S *Bsp_ExtensionPortI2cHandle = NULL;

static I2C_IRQ_Callback_T Bsp_ExtensionPort_McuI2cIrqCallback = NULL;

struct MCU_SPI_Handle_S Bsp_ExtensionPortSpiInstance;

struct MCU_SPI_Handle_S *Bsp_ExtensionPortSpiHandle = NULL;

#if BCDS_FEATURE_DMA
struct MCU_DMA_Channel_S Bsp_ExtensionPortSpiDmaTxCh;
struct MCU_DMA_Channel_S Bsp_ExtensionPortSpiDmaRxCh;

static SPI_DMA_Callback_T Bsp_ExtensionPortSpiTxDmaCb = NULL;
static SPI_DMA_Callback_T Bsp_ExtensionPortSpiRxDmaCb = NULL;
#endif
static SPI_IRQ_Callback_T Bsp_ExtensionPortSpiRxIsrCb;
static SPI_IRQ_Callback_T Bsp_ExtensionPortSpiTxIsrCb;

static UART_IRQ_Callback_T Bsp_ExtensionPortUartRxIsrCallback;
static UART_IRQ_Callback_T Bsp_ExtensionPortUartTxIsrCallback;
static struct MCU_UART_Handle_S Bsp_ExtensionPortUartInstance;
static struct MCU_UART_Handle_S *Bsp_ExtensionPortUartHandle = NULL;

/* Table to map  the user input enumeration BSP_ExtensionPortGpioPinMode_T to efm32 mode enumeration GPIO_Mode_TypeDef
 * @note The order it is populated is one -to-one mapping and hence the implementation must always ensure the table
 *       is in same order as it is enumerated in  BSP_ExtensionPortGpioPinMode_T.
 *
 * @warning Failing to take care of the above note may result in wrong configuration */
const GPIO_Mode_TypeDef BSP_ExtensionPortModeTable[BSP_EXTENSIONPORT_MODE_OUT_OF_RANGE] =
{
    gpioModeInput,
    gpioModeInputPull,
    gpioModeInputPull,
    gpioModeInputPullFilter,
    gpioModePushPull,
    gpioModePushPullDrive,
    gpioModeWiredOr,
    gpioModeWiredOrPullDown,
    gpioModeWiredAnd,
    gpioModeWiredAndFilter,
    gpioModeWiredAndPullUp,
    gpioModeWiredAndPullUpFilter
};

const BSP_ExtensionPort_Table_T BSP_ExtensionPortTable[BSP_EXTENSIONPORT_GPIO_MAX] =
{
    {   EXTENSION_PORT_GPIO_PA0, EXTENSION_PIN_GPIO_PA0},
    {   EXTENSION_PORT_GPIO_PA1, EXTENSION_PIN_GPIO_PA1},
    {   EXTENSION_PORT_GPIO_PB2, EXTENSION_PIN_GPIO_PB2},
    {   EXTENSION_PORT_GPIO_PB3, EXTENSION_PIN_GPIO_PB3},
    {   EXTENSION_PORT_GPIO_PB4, EXTENSION_PIN_GPIO_PB4},
    {   EXTENSION_PORT_GPIO_PB5, EXTENSION_PIN_GPIO_PB5},
    {   EXTENSION_PORT_GPIO_PB9, EXTENSION_PIN_GPIO_PB9},
    {   EXTENSION_PORT_GPIO_PB10, EXTENSION_PIN_GPIO_PB10},
    {   EXTENSION_PORT_GPIO_PB11, EXTENSION_PIN_GPIO_PB11},
    {   EXTENSION_PORT_GPIO_PB12, EXTENSION_PIN_GPIO_PB12},
    {   EXTENSION_PORT_GPIO_PC0, EXTENSION_PIN_GPIO_PC0},
    {   EXTENSION_PORT_GPIO_PC1, EXTENSION_PIN_GPIO_PC1},
    {   EXTENSION_PORT_GPIO_PC2, EXTENSION_PIN_GPIO_PC2},
    {   EXTENSION_PORT_GPIO_PC3, EXTENSION_PIN_GPIO_PC3},
    {   EXTENSION_PORT_GPIO_PC4, EXTENSION_PIN_GPIO_PC4},
    {   EXTENSION_PORT_GPIO_PC8, EXTENSION_PIN_GPIO_PC8},
    {   EXTENSION_PORT_GPIO_PC9, EXTENSION_PIN_GPIO_PC9},
    {   EXTENSION_PORT_GPIO_PC10, EXTENSION_PIN_GPIO_PC10},
    {   EXTENSION_PORT_GPIO_PD5, EXTENSION_PIN_GPIO_PD5},
    {   EXTENSION_PORT_GPIO_PD6, EXTENSION_PIN_GPIO_PD6},
    {   EXTENSION_PORT_GPIO_PD8, EXTENSION_PIN_GPIO_PD8},
    {   EXTENSION_PORT_GPIO_PE2, EXTENSION_PIN_GPIO_PE2},
    {   EXTENSION_PORT_GPIO_PF6, EXTENSION_PIN_GPIO_PF6},
};

BSP_ExtensionPort_Handle_T BSP_ExtensionPortInstance[BSP_EXTENSIONPORT_GPIO_MAX] =
{
    {   EXTENSION_MODE_GPIO_PA0, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PA1, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB2, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB3, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB4, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB5, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB9, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB10, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB11, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PB12, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC0, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC1, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC2, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC3, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC4, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC8, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC9, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PC10, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PD5, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PD6, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PD8, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PE2, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false},
    {   EXTENSION_MODE_GPIO_PF6, (uint8_t) BSP_EXTENSIONPORT_RESET_STATE, false, 0, false, false, false, 0, false}
};

/* Put private function declarations here */

