eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
/*
 * @brief  This static function is used to set the ownership state for I2c pins
 *
 * @retval RETCODE_OK in the case I2C ownership is set properly
 * @retval RETCODE_INVALID_PARAM in case of error
 */
static Retcode_T SetI2cOwnership(BSP_ExtensionPort_gpioOwner_T pinOwner)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdI2cData, pinIdI2cClk;
    pinIdI2cData = BSP_EXTENSIONPORT_GPIO_PB11; /* I2C1 data pin */
    pinIdI2cClk = BSP_EXTENSIONPORT_GPIO_PB12; /* I2C1 clock pin */
    retVal = BSP_ExtensionPort_SetGpioOwner(pinIdI2cData, pinOwner);
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_SetGpioOwner(pinIdI2cClk, pinOwner);
    }
    return retVal;
}

/*
 * @brief  This static function is used to verify the ownership state of I2c pins
 *
 * @retval  RETCODE_OK if the pins are available for I2C connect
 * @retval  RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE  if the pins are already assigned for some other functions
 */
static Retcode_T IsI2cPortAvailable(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdI2cData, pinIdI2cClk;
    pinIdI2cData = BSP_EXTENSIONPORT_GPIO_PB11; /* I2C1 data pin */
    pinIdI2cClk = BSP_EXTENSIONPORT_GPIO_PB12; /* I2C1 clock pin */
    BSP_ExtensionPort_gpioOwner_T getgpioOwnerI2cData, getgpioOwnerI2cClk;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinIdI2cData, &getgpioOwnerI2cData);
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_GetGpioOwner(pinIdI2cClk, &getgpioOwnerI2cClk);
    }
    if (RETCODE_OK == retVal)
    {
        if ((BSP_EXTENSIONPORT_RESET_STATE != getgpioOwnerI2cData) || (BSP_EXTENSIONPORT_RESET_STATE != getgpioOwnerI2cClk))
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE);
        }
    }
    return retVal;
}

static bool CheckIrqNotRegistred(BSP_ExtensionPort_PinId_T pinID)
{
    GPIOINT_IrqCallbackPtr_t callback;
    callback = BoardCommon_GPIOInterruptGetCallback(BSP_ExtensionPortTable[pinID].Pin);
    if (NULL != callback)
    {
        return false;
    }
    else
    {
        return true;
    }
}
static bool getPinDirectionFromMode(BSP_ExtensionPortGpioPinMode_T mode)
{

    bool result = false; // output pin
    if (BSP_EXTENSIONPORT_INPUTPULLFILTER >= mode)
    {
        result = true; // Input pin
    }
    return (result);
}

static void TristateAllExtensionPortGpios(void)
{
    uint32_t index = 0;
    do
    {
        GPIO_PinModeSet(BSP_ExtensionPortTable[index].Port, BSP_ExtensionPortTable[index].Pin, gpioModeDisabled, 0);
        index++;
    }while ((uint32_t) BSP_EXTENSIONPORT_GPIO_MAX > index);

}
#if BCDS_FEATURE_DMA
static void Bsp_ExtPortSpiRxDMAComplete(uint32_t channel, bool primary, void * user)
{
    BCDS_UNUSED(channel);
    BCDS_UNUSED(primary);
    BCDS_UNUSED(user);

    if (NULL != Bsp_ExtensionPortSpiRxDmaCb)
    {
        /* interrupt processing is to be done at the MCU level */
        Bsp_ExtensionPortSpiRxDmaCb((SPI_T) Bsp_ExtensionPortSpiHandle);
    }
}

static void Bsp_ExtPortSpiTxDMAComplete(uint32_t channel, bool primary, void * user)
{
    BCDS_UNUSED(channel);
    BCDS_UNUSED(primary);
    BCDS_UNUSED(user);

    if (NULL != Bsp_ExtensionPortSpiTxDmaCb)
    {
        /* interrupt processing is to be done at the MCU level */
        Bsp_ExtensionPortSpiTxDmaCb((SPI_T) Bsp_ExtensionPortSpiHandle);
    }
}
#endif

/*
 * @brief  This static function is used to verify the ownership state of SPI pins
 *
 * @retval  RETCODE_OK if the pins are available for SPI connect
 * @retval  RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE  if the pins are already assigned for some other functions
 */
static Retcode_T IsSpiPortAvailable(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_gpioOwner_T getgpioOwnerSpiMiso, getgpioOwnerSpiMosi, getgpioOwnerSpiClk;
    retVal = BSP_ExtensionPort_GetGpioOwner(BSP_EXTENSIONPORT_GPIO_PB3, &getgpioOwnerSpiMosi);
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_GetGpioOwner(BSP_EXTENSIONPORT_GPIO_PB4, &getgpioOwnerSpiMiso);
    }
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_GetGpioOwner(BSP_EXTENSIONPORT_GPIO_PB5, &getgpioOwnerSpiClk);
    }
    if (RETCODE_OK == retVal)
    {
        if ((BSP_EXTENSIONPORT_RESET_STATE != getgpioOwnerSpiMiso) || (BSP_EXTENSIONPORT_RESET_STATE != getgpioOwnerSpiMosi) || (BSP_EXTENSIONPORT_RESET_STATE != getgpioOwnerSpiClk))
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE);
        }
    }
    return retVal;
}

/* This static function is used to set the ownership state for SPI pins
 *
 * @retVal RETCODE_OK  Successfully Set the PinOwner State to the Spi pins.
 * @retVal RETCODE_INVALID_PARAM in case the passing parameter Spi pins are  out the range of GPIO Pin Id Table.
 *
 */
static Retcode_T SetSpiOwnership(BSP_ExtensionPort_gpioOwner_T pinOwner)
{
    Retcode_T retVal = RETCODE_OK;
    retVal = BSP_ExtensionPort_SetGpioOwner(BSP_EXTENSIONPORT_GPIO_PB3, pinOwner);
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_SetGpioOwner(BSP_EXTENSIONPORT_GPIO_PB4, pinOwner);
    }
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_SetGpioOwner(BSP_EXTENSIONPORT_GPIO_PB5, pinOwner);
    }
    return retVal;
}

/* @brief This static function is used to set the ownership state for UART pins
 *
 * @retval RETCODE_OK if the I2C ownership is set properly and error code otherwise.
 *
 */
static Retcode_T SetUartOwnership(BSP_ExtensionPort_gpioOwner_T pinOwner)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdTx, pinIdRx;

    pinIdTx = BSP_EXTENSIONPORT_GPIO_PB9; /*Tx pin */
    pinIdRx = BSP_EXTENSIONPORT_GPIO_PB10; /*Rx pin */

    retVal = BSP_ExtensionPort_SetGpioOwner(pinIdTx, pinOwner);
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_SetGpioOwner(pinIdRx, pinOwner);
    }
    return retVal;
}

/*
 *  This static function is used to get the ownership state of UART pins
 *  ----------------------------------------------------------------------------------------------------------------------------------
 *  | pinIdTx                           |     pinIdTx                       |  API output                                            |
 *  |-----------------------------------|-----------------------------------|--------------------------------------------------------|
 *  |USED_BY_UART                       |     USED_BY_UART                  |  RETCODE_OK                                            |
 *  |USED_BY_UART                       |     USED_BY_UART                  |  RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE                 |
 *  |-----------------------------------|-----------------------------------|--------------------------------------------------------|
 */

