eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
static Retcode_T IsUartPortAvailable(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdTx, pinIdRx;

    pinIdTx = BSP_EXTENSIONPORT_GPIO_PB9; /*Tx pin */
    pinIdRx = BSP_EXTENSIONPORT_GPIO_PB10; /*Rx pin */
    BSP_ExtensionPort_gpioOwner_T getgpioOwnerUartTx, getgpioOwnerUartRx;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinIdRx, &getgpioOwnerUartRx);
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_GetGpioOwner(pinIdTx, &getgpioOwnerUartTx);
    }
    if (RETCODE_OK == retVal )
    {
        if((BSP_EXTENSIONPORT_RESET_STATE != getgpioOwnerUartRx) || (BSP_EXTENSIONPORT_RESET_STATE != getgpioOwnerUartTx))
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE);
        }
    }
    return retVal;
}

/*
 *  Refer for description BspExtensionPort.h
 *
 */
Retcode_T BSP_ExtensionPort_SetGpioOwner(BSP_ExtensionPort_PinId_T pinID, BSP_ExtensionPort_gpioOwner_T setOwner)
{
    Retcode_T retVal = RETCODE_OK;
    uint8_t setOwnerInfo = (uint8_t) setOwner;
    if (BSP_EXTENSIONPORT_GPIO_MAX <= pinID)
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    else
    {
        BSP_ExtensionPortInstance[pinID].gpioUsedFor = setOwnerInfo;
    }
    return retVal;
}

/*
 * Refer for description BspExtensionPort.h
 */
Retcode_T BSP_ExtensionPort_GetGpioOwner(BSP_ExtensionPort_PinId_T pinID, BSP_ExtensionPort_gpioOwner_T *getOwner)
{
    Retcode_T retVal = RETCODE_OK;
    if ((BSP_EXTENSIONPORT_GPIO_MAX <= pinID) || (NULL == getOwner))
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    else
    {
        *getOwner = (BSP_ExtensionPort_gpioOwner_T) BSP_ExtensionPortInstance[pinID].gpioUsedFor;
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_ConnectGpio(BSP_ExtensionPort_PinId_T pinID)
{
    Retcode_T retVal = RETCODE_OK;
    if (BSP_EXTENSIONPORT_GPIO_MAX <= pinID)
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_RESET_STATE != getgpioOwner)
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE);
        }
        else
        {
            GPIO_PinModeSet(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin, gpioModeDisabled, 0);
        }
    }
    if (RETCODE_OK == retVal)
    {
        retVal = BSP_ExtensionPort_SetGpioOwner(pinID, BSP_EXTENSIONPORT_PIN_USEDBY_GPIO);
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_DisconnectGpio(BSP_ExtensionPort_PinId_T pinID)
{
    Retcode_T retVal = RETCODE_OK;
    if (BSP_EXTENSIONPORT_GPIO_MAX <= pinID)
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO == getgpioOwner)
        {
            GPIO_PinModeSet(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin, gpioModeDisabled, 0);
            retVal = BSP_ExtensionPort_SetGpioOwner(pinID, BSP_EXTENSIONPORT_RESET_STATE);
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED);
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE);
        }
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_SetGpioConfig(BSP_ExtensionPort_PinId_T pinID, BSP_ExtensionPortGpioConfig_T configItem, uint32_t value, void * pvalue)
{
    BCDS_UNUSED(pvalue);
    Retcode_T retVal = RETCODE_OK;
    if (BSP_EXTENSIONPORT_GPIO_MAX <= pinID)
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE);
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED);
        }
    }
    if (RETCODE_OK == retVal)
    {
        switch (configItem)
        {
            case BSP_EXTENSIONPORT_GPIO_PINMODE:
            if (BSP_EXTENSIONPORT_MODE_OUT_OF_RANGE <= (BSP_ExtensionPortGpioPinMode_T) value)
            {
                retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
            }
            else
            {
                BSP_ExtensionPortInstance[pinID].Mode = BSP_ExtensionPortModeTable[value];
                BSP_ExtensionPortInstance[pinID].gpioPinDirection = getPinDirectionFromMode((BSP_ExtensionPortGpioPinMode_T) value);
            }
            break;
            case BSP_EXTENSIONPORT_GPIO_PINVALUE:
            if ((uint32_t) BSP_EXTENSIONPORT_GPIO_PIN_LOW == value)
            {
                BSP_ExtensionPortInstance[pinID].gpioPinValue = false;
            }
            else if ((uint32_t) BSP_EXTENSIONPORT_GPIO_PIN_HIGH == value)
            {
                BSP_ExtensionPortInstance[pinID].gpioPinValue = true;
            }
            else
            {
                retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
            }
            break;
            default:
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
            break;
        }
    }
    return retVal;
}

