eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_RegisterGpioInt(BSP_ExtensionPort_PinId_T pinID, BSP_ExtensionPort_GpioIntMode_T interruptMode, BSP_ExtensionPort_GpioCallback_T gpioAppCallBack)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    if ((BSP_EXTENSIONPORT_GPIO_MAX <= (BSP_ExtensionPort_PinId_T) pinID) || (BSP_EXTENSIONPORT_INT_OUT_OF_RANGE <= (BSP_ExtensionPort_GpioIntMode_T) interruptMode) || (NULL == gpioAppCallBack))
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM));
    }

    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE));
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED));
        }
    }
    if (false == BSP_ExtensionPortInstance[pinID].gpioPinDirection)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_INT_REQ_ON_OUTPUT_PIN));
    }

    if ((BSP_EXTENSIONPORT_INT_LEVEL_LOW == interruptMode) || (BSP_EXTENSIONPORT_INT_LEVEL_HIGH == interruptMode))
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NOT_SUPPORTED));
    }
    else if (BSP_EXTENSIONPORT_INT_EDGE_RAISING == interruptMode)
    {
        BSP_ExtensionPortInstance[pinID].gpioInterruptFallingEdge = false;
        BSP_ExtensionPortInstance[pinID].gpioInterruptRaisingEdge = true;
        BSP_ExtensionPortInstance[pinID].gpioInterruptType = true; // Edge Trigger
    }
    else if (BSP_EXTENSIONPORT_INT_EDGE_FALLING == interruptMode)
    {
        BSP_ExtensionPortInstance[pinID].gpioInterruptFallingEdge = true;
        BSP_ExtensionPortInstance[pinID].gpioInterruptRaisingEdge = false;
        BSP_ExtensionPortInstance[pinID].gpioInterruptType = true; // Edge Trigger
    }
    else if (BSP_EXTENSIONPORT_INT_EDGE_BOTH == interruptMode)
    {
        BSP_ExtensionPortInstance[pinID].gpioInterruptFallingEdge = true;
        BSP_ExtensionPortInstance[pinID].gpioInterruptRaisingEdge = true;
        BSP_ExtensionPortInstance[pinID].gpioInterruptType = true; // Edge Trigger
    }
    if (CheckIrqNotRegistred(pinID))
    {
        BoardCommon_GPIOInterruptRegisterCallback((uint8_t) BSP_ExtensionPortTable[pinID].Pin, (GPIOINT_IrqCallbackPtr_t) gpioAppCallBack);
        BSP_ExtensionPortInstance[pinID].gpioEnableInterrupt = true;
    }
    else
    {
        retVal = (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_INT_BUSY));
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_ToggleGpio(BSP_ExtensionPort_PinId_T pinID)
{
    Retcode_T retVal = RETCODE_OK;
    if ((BSP_EXTENSIONPORT_GPIO_MAX <= pinID))
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE));
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED));
        }
    }
    GPIO_PinOutToggle(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin);
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_SetGpio(BSP_ExtensionPort_PinId_T pinID)
{
    Retcode_T retVal = RETCODE_OK;
    if ((BSP_EXTENSIONPORT_GPIO_MAX <= pinID))
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE));
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED));
        }
    }
    GPIO_PinOutSet(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin);
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_ClearGpio(BSP_ExtensionPort_PinId_T pinID)
{
    Retcode_T retVal = RETCODE_OK;
    if ((BSP_EXTENSIONPORT_GPIO_MAX <= pinID))
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE));
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED));
        }
    }
    GPIO_PinOutClear(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin);
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_ReadGpio(BSP_ExtensionPort_PinId_T pinID, uint8_t *currentPinVal)
{
    Retcode_T retVal = RETCODE_OK;
    if ((BSP_EXTENSIONPORT_GPIO_MAX <= pinID) || (NULL == currentPinVal))
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE));
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED));
        }
    }
    *currentPinVal = GPIO_PinInGet(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin);
    return retVal;
}

