eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_EnableGpio(BSP_ExtensionPort_PinId_T pinID)
{
    Retcode_T retVal = RETCODE_OK;
    uint32_t pinVal;
    if (BSP_EXTENSIONPORT_GPIO_MAX <= pinID)
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE));
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED));
        }
    }
    if (BSP_ExtensionPortInstance[pinID].gpioPinValue == true)
    {
        pinVal = UINT32_C(1);
    }
    else
    {
        pinVal = UINT32_C(0);
    }
    GPIO_PinModeSet(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin, BSP_ExtensionPortInstance[pinID].Mode, pinVal);
    if ( true == BSP_ExtensionPortInstance[pinID].gpioEnableInterrupt)
    {
        NVIC_DisableIRQ(GPIO_ODD_IRQn);
        NVIC_DisableIRQ(GPIO_EVEN_IRQn);
        GPIO_IntConfig(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin, BSP_ExtensionPortInstance[pinID].gpioInterruptRaisingEdge,
                BSP_ExtensionPortInstance[pinID].gpioInterruptFallingEdge, BSP_ENABLE);
        NVIC_EnableIRQ(GPIO_ODD_IRQn);
        NVIC_EnableIRQ(GPIO_EVEN_IRQn);
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_DisableGpio(BSP_ExtensionPort_PinId_T pinID)
{
    Retcode_T retVal = RETCODE_OK;
    if (BSP_EXTENSIONPORT_GPIO_MAX <= pinID)
    {
        return RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
    }
    BSP_ExtensionPort_gpioOwner_T getgpioOwner;
    retVal = BSP_ExtensionPort_GetGpioOwner(pinID, &getgpioOwner);
    if (RETCODE_OK == retVal)
    {
        if (BSP_EXTENSIONPORT_PIN_USEDBY_GPIO != getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_IN_USE));
        }
        else if (BSP_EXTENSIONPORT_RESET_STATE == getgpioOwner)
        {
            return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_GPIO_NOT_CONNECTED));
        }
        if ( true == BSP_ExtensionPortInstance[pinID].gpioEnableInterrupt)
        {
            GPIO_IntConfig(BSP_ExtensionPortTable[pinID].Port, BSP_ExtensionPortTable[pinID].Pin, BSP_ExtensionPortInstance[pinID].gpioInterruptRaisingEdge,
                    BSP_ExtensionPortInstance[pinID].gpioInterruptFallingEdge, BSP_DISABLE);
            /* Free the registered Interrupt callback slot, so that others can make use of it */
            BoardCommon_GPIOInterruptUnregisterCallback(BSP_ExtensionPortTable[pinID].Pin);
            BSP_ExtensionPortInstance[pinID].gpioEnableInterrupt = false;
        }
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_Connect(void)
{
    Retcode_T retVal = RETCODE_OK;
    TristateAllExtensionPortGpios();
    BoardCommon_WakeupPowerSupply2V5(EXTENSION_BOARD);
    BoardCommon_EnablePowerSupply3V3(EXTENSION_BOARD);
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_Disconnect(void)
{
    Retcode_T retVal = RETCODE_OK;
    BoardCommon_SnoozePowerSupply2V5(EXTENSION_BOARD);
    BoardCommon_DisablePowerSupply3V3(EXTENSION_BOARD);
    TristateAllExtensionPortGpios();
    return retVal;
}

/*
 * Refer to interface header for description
 */
HWHandle_T BSP_ExtensionPort_GetI2cHandle(void)
{
    HWHandle_T Handle = (HWHandle_T) Bsp_ExtensionPortI2cHandle;
    return Handle;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_ConnectI2c(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdI2cData, pinIdI2cClk;
    pinIdI2cData = BSP_EXTENSIONPORT_GPIO_PB11; /* I2C1 data pin */
    pinIdI2cClk = BSP_EXTENSIONPORT_GPIO_PB12; /* I2C1 clock pin */

    retVal = IsI2cPortAvailable();
    if (RETCODE_OK == retVal)
    {
        retVal = SetI2cOwnership(BSP_EXTENSIONPORT_PIN_USEDBY_I2C);
        if (RETCODE_OK == retVal)
        {
            Bsp_ExtensionPortI2cInstance.instance = EXTENSION_PORT_I2C_BUS;
            Bsp_ExtensionPortI2cInstance.TransferMode = BCDS_HAL_TRANSFER_MODE_INTERRUPT;
            GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdI2cData].Port, BSP_ExtensionPortTable[pinIdI2cData].Pin, gpioModeDisabled, 0);
            GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdI2cClk].Port, BSP_ExtensionPortTable[pinIdI2cClk].Pin, gpioModeDisabled, 0);
            Bsp_ExtensionPortI2cHandle = &Bsp_ExtensionPortI2cInstance;
        }
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_SetI2cConfig(BSP_ExtensionPortI2cConfig_T configItem, uint32_t value, void * pvalue)
{
    BCDS_UNUSED(pvalue);
    Retcode_T retVal = RETCODE_OK;

    if (NULL == Bsp_ExtensionPortI2cHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_I2C_NOT_CONNECTED));
    }
    switch (configItem)
    {
        case BSP_EXTENSIONPORT_I2C_MODE:
        if (BSP_EXTENSIONPORT_I2C_FASTPLUS_MODE >= value)
        {
            Bsp_ExtensionPortI2cHandle->I2cClockFreq = value;
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        }
        break;
        default:
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        break;
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_EnableI2c(void)
{
    Retcode_T retVal = RETCODE_OK;
    I2C_Init_TypeDef i2cInit =
    {   false, true, 0, I2C_FREQ_FAST_MAX, i2cClockHLRStandard};
    BSP_ExtensionPort_PinId_T pinIdI2cData, pinIdI2cClk;
    pinIdI2cData = BSP_EXTENSIONPORT_GPIO_PB11; /* I2C1 data pin */
    pinIdI2cClk = BSP_EXTENSIONPORT_GPIO_PB12; /* I2C1 clock pin */

    if (NULL == Bsp_ExtensionPortI2cHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_I2C_NOT_CONNECTED));
    }
    /* Properly connected the GPIO pins (SDA, SCK)  */
    GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdI2cData].Port, BSP_ExtensionPortTable[pinIdI2cData].Pin, EXTENSION_I2C_SDA_MODE, EXTENSION_I2C_SDA_DOUT);
    GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdI2cClk].Port, BSP_ExtensionPortTable[pinIdI2cClk].Pin, EXTENSION_I2C_SCK_MODE, EXTENSION_I2C_SCK_DOUT);

    if (BSP_EXTENSIONPORT_I2C_STANDARD_MODE == Bsp_ExtensionPortI2cHandle->I2cClockFreq)
    {
        i2cInit.freq = I2C_FREQ_STANDARD_MAX;
        i2cInit.clhr = i2cClockHLRStandard;
    }
    else if (BSP_EXTENSIONPORT_I2C_FAST_MODE == Bsp_ExtensionPortI2cHandle->I2cClockFreq)
    {
        i2cInit.freq = I2C_FREQ_FAST_MAX;
        i2cInit.clhr = i2cClockHLRAsymetric;
    }
    else if (BSP_EXTENSIONPORT_I2C_FASTPLUS_MODE == Bsp_ExtensionPortI2cHandle->I2cClockFreq)
    {
        i2cInit.freq = I2C_FREQ_FASTPLUS_MAX;
        i2cInit.clhr = i2cClockHLRFast;
    }
    CMU_ClockEnable(EXTENSION_PORT_I2C_CLOCK, BSP_ENABLE);

    (Bsp_ExtensionPortI2cHandle->instance)->ROUTE = I2C_ROUTE_SDAPEN | I2C_ROUTE_SCLPEN | I2C_ROUTE_LOCATION_LOC1;
    /* It is mandatory to  fill proper value for IRQCallback while initializing using MCU_I2C_Initialize() api call */
    if (NULL != Bsp_ExtensionPortI2cHandle->IRQCallback)
    {
        Bsp_ExtensionPort_McuI2cIrqCallback = Bsp_ExtensionPortI2cHandle->IRQCallback;
        NVIC_SetPriority(EXTENSION_PORT_I2C_IRQn, EXTENSION_PORT_I2C_NVIC_PRIORITY);
        NVIC_EnableIRQ(EXTENSION_PORT_I2C_IRQn);
        I2C_Init(Bsp_ExtensionPortI2cHandle->instance, &i2cInit);
        I2C_Enable(Bsp_ExtensionPortI2cHandle->instance, BSP_ENABLE);
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_I2C_MCU_IRQ_CALLBACK_NULL);
    }
    return retVal;
}

