eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_DisableI2c(void)
{
    Retcode_T retVal = RETCODE_OK;

    if (NULL == Bsp_ExtensionPortI2cHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_I2C_NOT_CONNECTED));
    }
    NVIC_DisableIRQ(EXTENSION_PORT_I2C_IRQn);
    /* Make the internally copied MCU Irq callback address to NULL*/
    Bsp_ExtensionPort_McuI2cIrqCallback = NULL;
    /* Disable I2C on extension port */
    I2C_Enable(Bsp_ExtensionPortI2cHandle->instance, BSP_DISABLE);
    CMU_ClockEnable(EXTENSION_PORT_I2C_CLOCK, BSP_DISABLE);
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_DisonnectI2c(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdI2cData, pinIdI2cClk;
    pinIdI2cData = BSP_EXTENSIONPORT_GPIO_PB11; /* I2C1 data pin */
    pinIdI2cClk = BSP_EXTENSIONPORT_GPIO_PB12; /* I2C1 clock pin */

    if (NULL == Bsp_ExtensionPortI2cHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_I2C_NOT_CONNECTED));
    }

    retVal = SetI2cOwnership(BSP_EXTENSIONPORT_RESET_STATE);

    if (RETCODE_OK == retVal)
    {
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdI2cData].Port, BSP_ExtensionPortTable[pinIdI2cData].Pin, gpioModeDisabled, 0);
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdI2cClk].Port, BSP_ExtensionPortTable[pinIdI2cClk].Pin, gpioModeDisabled, 0);
        /* Configure the Route for the I2C */
        CMU_ClockEnable(EXTENSION_PORT_I2C_CLOCK, BSP_ENABLE);
        Bsp_ExtensionPortI2cHandle->instance->ROUTE = _I2C_ROUTE_RESETVALUE;
        Bsp_ExtensionPortI2cHandle->instance = NULL;
        CMU_ClockEnable(EXTENSION_PORT_I2C_CLOCK, BSP_DISABLE);
        Bsp_ExtensionPortI2cHandle = NULL;
    }
    return retVal;
}

/*
 * Refer description in the header file BspExtensionPort.h
 */
void BSP_ExtensionPort_I2cIsr(void)
{
    Retcode_T retVal = RETCODE_OK;

    if ((NULL != Bsp_ExtensionPort_McuI2cIrqCallback) && (NULL != Bsp_ExtensionPortI2cHandle))
    {
        /* All I2C interrupt processing is to be done at the MCU level */
        Bsp_ExtensionPort_McuI2cIrqCallback((I2C_T) Bsp_ExtensionPortI2cHandle);
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER);
        Retcode_RaiseErrorFromIsr(retVal);
    }
}

/*
 * Refer to interface header for description
 */

HWHandle_T BSP_ExtensionPort_GetSpiHandle(void)
{
    HWHandle_T Handle = (HWHandle_T) Bsp_ExtensionPortSpiHandle;
    return Handle;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_ConnectSpi(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdSpiMosi, pinIdSpiMiso, pinIdSpiClk;
    pinIdSpiMosi = BSP_EXTENSIONPORT_GPIO_PB3; /* SPI1 mosi pin */
    pinIdSpiMiso = BSP_EXTENSIONPORT_GPIO_PB4; /* SPI1 miso pin */
    pinIdSpiClk = BSP_EXTENSIONPORT_GPIO_PB5; /* SPI1 clock pin */

    retVal = IsSpiPortAvailable();
    if (RETCODE_OK == retVal)
    {
        retVal = SetSpiOwnership(BSP_EXTENSIONPORT_PIN_USEDBY_SPI);
    }
    if (RETCODE_OK == retVal)
    {
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiMosi].Port, BSP_ExtensionPortTable[pinIdSpiMosi].Pin, gpioModeDisabled, 0);
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiMiso].Port, BSP_ExtensionPortTable[pinIdSpiMiso].Pin, gpioModeDisabled, 0);
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiClk].Port, BSP_ExtensionPortTable[pinIdSpiClk].Pin, gpioModeDisabled, 0);
        CMU_ClockEnable(cmuClock_USART2, true);
        Bsp_ExtensionPortSpiInstance.Instance = USART2;
        CMU_ClockEnable(cmuClock_USART2, false);
#if BCDS_FEATURE_DMA
        Bsp_ExtensionPortSpiDmaTxCh.ChannelId = EXTENSIONPORT_SPI_TX_DMA_CHANNEL;
        Bsp_ExtensionPortSpiDmaTxCh.Config.highPri = false;
        Bsp_ExtensionPortSpiDmaTxCh.Config.enableInt = true;
        Bsp_ExtensionPortSpiDmaTxCh.Config.select = DMAREQ_USART2_TXBL;
        Bsp_ExtensionPortSpiDmaTxCh.CallBack.cbFunc = (DMA_FuncPtr_TypeDef) Bsp_ExtPortSpiTxDMAComplete;
        Bsp_ExtensionPortSpiDmaTxCh.CallBack.userPtr = &Bsp_ExtensionPortSpiInstance;

        Bsp_ExtensionPortSpiDmaRxCh.ChannelId = EXTENSIONPORT_SPI_RX_DMA_CHANNEL;
        Bsp_ExtensionPortSpiDmaRxCh.Config.highPri = false;
        Bsp_ExtensionPortSpiDmaRxCh.Config.enableInt = true;
        Bsp_ExtensionPortSpiDmaRxCh.Config.select = DMAREQ_USART2_RXDATAV;
        Bsp_ExtensionPortSpiDmaRxCh.CallBack.cbFunc = (DMA_FuncPtr_TypeDef) Bsp_ExtPortSpiRxDMAComplete;
        Bsp_ExtensionPortSpiDmaRxCh.CallBack.userPtr = &Bsp_ExtensionPortSpiInstance;

        Bsp_ExtensionPortSpiInstance.Link1 = (void*) &Bsp_ExtensionPortSpiDmaTxCh;
        Bsp_ExtensionPortSpiInstance.Link2 = (void*) &Bsp_ExtensionPortSpiDmaRxCh;

        Bsp_ExtensionPortSpiInstance.TransferMode = BCDS_HAL_TRANSFER_MODE_DMA;
#else
        Bsp_ExtensionPortSpiInstance.TransferMode = BCDS_HAL_TRANSFER_MODE_INTERRUPT;
#endif
        Bsp_ExtensionPortSpiHandle = &Bsp_ExtensionPortSpiInstance;
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_SetSpiConfig(BSP_ExtensionPortSpiConfig_T configItem, uint32_t value, void * pvalue)
{
    Retcode_T retVal = RETCODE_OK;
    BCDS_UNUSED(pvalue);
    if (NULL == Bsp_ExtensionPortSpiHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_SPI_NOT_CONNECTED));
    }
    switch (configItem)
    {
        case BSP_EXTENSIONPORT_SPI_BAUDRATE:
        if((UINT32_C(0) < value) && (UINT32_MAX > value))
        {
            /* Setting baudrate */
            Bsp_ExtensionPortSpiHandle->Baudrate = (uint32_t) value;
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        }
        break;
        case BSP_EXTENSIONPORT_SPI_MODE:
        if(BSP_EXTENSIONPORT_SPI_MODE3 >= value)
        {
            Bsp_ExtensionPortSpiHandle->Mode = (uint8_t) value;
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        }
        break;
        case BSP_EXTENSIONPORT_SPI_BIT_ORDER:
        if(BSP_EXTENSIONPORT_SPI_LSB_FIRST >=value)
        {
            Bsp_ExtensionPortSpiHandle->BitOrder = (uint8_t) value;
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        }
        break;
        default:
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        break;
    }
    return retVal;
}

