eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_EnableSpi(void)
{
    Retcode_T retVal = RETCODE_OK;
    /* Default configurations for the Usart Handle if the BSP_ExtensionPort_ConnectSpi() is not called by user */
    USART_InitSync_TypeDef efmUsartHandle =
    {   EXTENSIONPORT_SPI_STATE, EXTENSIONPORT_SPI_REF_FREQ, EXTENSIONPORT_SPI_BAUDRATE, EXTENSIONPORT_SPI_DATABITS,
        EXTENSIONPORT_SPI_MASTERMODE_ENABLE, EXTENSIONPORT_SPI_MSB_ENABLE, EXTENSIONPORT_SPI_CLOCKMODE,EXTENSIONPORT_SPI_PRS_RX_ENABLE,
        EXTENSIONPORT_SPI_PRS_RX_CHANNEL, EXTENSIONPORT_SPI_AUTOTX_ENABLE};

    BSP_ExtensionPort_PinId_T pinIdSpiMosi, pinIdSpiMiso, pinIdSpiClk;
    pinIdSpiMosi = BSP_EXTENSIONPORT_GPIO_PB3; /* SPI1 mosi pin */
    pinIdSpiMiso = BSP_EXTENSIONPORT_GPIO_PB4; /* SPI1 miso pin */
    pinIdSpiClk = BSP_EXTENSIONPORT_GPIO_PB5; /* SPI1 clock pin */
    if (NULL == Bsp_ExtensionPortSpiHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_SPI_NOT_CONNECTED));
    }
    GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiMosi].Port,BSP_ExtensionPortTable[pinIdSpiMosi].Pin, gpioModePushPull,0);
    GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiMiso].Port,BSP_ExtensionPortTable[pinIdSpiMiso].Pin, gpioModeInput,0);
    GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiClk].Port,BSP_ExtensionPortTable[pinIdSpiClk].Pin, gpioModePushPull,0);
    CMU_ClockEnable(cmuClock_USART2, true);

    /* Setting Baudrate */
    efmUsartHandle.baudrate = Bsp_ExtensionPortSpiHandle->Baudrate;
    /* Setting SPI Mode */
    if (BSP_EXTENSIONPORT_SPI_MODE0 == Bsp_ExtensionPortSpiHandle->Mode)
    {
        efmUsartHandle.clockMode = usartClockMode0;
    }
    else if (BSP_EXTENSIONPORT_SPI_MODE1 == Bsp_ExtensionPortSpiHandle->Mode)
    {
        efmUsartHandle.clockMode = usartClockMode1;

    }
    else if (BSP_EXTENSIONPORT_SPI_MODE2 == Bsp_ExtensionPortSpiHandle->Mode)
    {
        efmUsartHandle.clockMode = usartClockMode2;
    }
    else
    {
        efmUsartHandle.clockMode = usartClockMode3;
    }
    /* Setting Most Significant Bit */
    if (BSP_EXTENSIONPORT_SPI_LSB_FIRST >= Bsp_ExtensionPortSpiHandle->BitOrder)
    {
        if (BSP_EXTENSIONPORT_SPI_MSB_FIRST == Bsp_ExtensionPortSpiHandle->BitOrder)
        {
            /* Set Most Significant Bit First */
            efmUsartHandle.msbf = true;
        }
        else
        {
            /* Set Least Significant Bit First */
            efmUsartHandle.msbf = false;
        }
    }
    /* By default after the initialization Usart module is disabled */
    USART_InitSync(Bsp_ExtensionPortSpiHandle->Instance,&efmUsartHandle);
    Bsp_ExtensionPortSpiHandle->Instance->ROUTE = USART_ROUTE_RXPEN | USART_ROUTE_TXPEN | USART_ROUTE_CLKPEN | USART_ROUTE_LOCATION_LOC1;
    USART_IntClear(Bsp_ExtensionPortSpiHandle->Instance,_USART_IFC_MASK);
    USART_IntDisable(Bsp_ExtensionPortSpiHandle->Instance,_USART_IEN_MASK);

    /* Set interrupt priorities */
    NVIC_SetPriority(EXTENSIONPORT_SPI_RX_IRQN, EXTENSIONPORT_SPI_RX_INT_PRIORITY);
    NVIC_SetPriority(EXTENSIONPORT_SPI_TX_IRQN, EXTENSIONPORT_SPI_TX_INT_PRIORITY);

    /* clear pending interrupts */
    NVIC_ClearPendingIRQ(EXTENSIONPORT_SPI_RX_IRQN);
    NVIC_ClearPendingIRQ(EXTENSIONPORT_SPI_TX_IRQN);

    NVIC_EnableIRQ(EXTENSIONPORT_SPI_RX_IRQN);
    NVIC_EnableIRQ(EXTENSIONPORT_SPI_TX_IRQN);

    if((Bsp_ExtensionPortSpiHandle->IrqRxCallback != NULL) && (Bsp_ExtensionPortSpiHandle->IrqTxCallback != NULL))
    {
        Bsp_ExtensionPortSpiRxIsrCb = Bsp_ExtensionPortSpiHandle->IrqRxCallback;
        Bsp_ExtensionPortSpiTxIsrCb = Bsp_ExtensionPortSpiHandle->IrqTxCallback;
#if BCDS_FEATURE_DMA
        Bsp_ExtensionPortSpiRxDmaCb = Bsp_ExtensionPortSpiHandle->DmaRxCallback;
        Bsp_ExtensionPortSpiTxDmaCb = Bsp_ExtensionPortSpiHandle->DmaTxCallback;
#endif

        USART_IntEnable(Bsp_ExtensionPortSpiHandle->Instance,USART_IEN_TXBL);
        USART_IntEnable(Bsp_ExtensionPortSpiHandle->Instance,(USART_IEN_RXDATAV | USART_IEN_PERR | USART_IEN_FERR | USART_IEN_RXOF));
        USART_Enable(Bsp_ExtensionPortSpiHandle->Instance, BSP_ENABLE);
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_SPI_MCU_IRQ_CALLBACK_NULL);
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_DisableSpi(void)
{
    Retcode_T retVal = RETCODE_OK;
    if (NULL == Bsp_ExtensionPortSpiHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_SPI_NOT_CONNECTED));
    }
    /* Disable the USART clock*/
    CMU_ClockEnable(cmuClock_USART2, false);
    NVIC_DisableIRQ(EXTENSIONPORT_SPI_RX_IRQN);
    NVIC_DisableIRQ(EXTENSIONPORT_SPI_TX_IRQN);

    Bsp_ExtensionPortSpiRxIsrCb = NULL;
    Bsp_ExtensionPortSpiTxIsrCb = NULL;
#if BCDS_FEATURE_DMA
    Bsp_ExtensionPortSpiRxDmaCb = NULL;
    Bsp_ExtensionPortSpiTxDmaCb = NULL;
#endif
    return retVal;
}

/*
 * Refer interface description available in BspExtensionPort.h
 */

Retcode_T BSP_ExtensionPort_DisonnectSpi(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdSpiMosi, pinIdSpiMiso, pinIdSpiClk;
    pinIdSpiMosi = BSP_EXTENSIONPORT_GPIO_PB3; /* SPI1 mosi pin */
    pinIdSpiMiso = BSP_EXTENSIONPORT_GPIO_PB4; /* SPI1 miso pin */
    pinIdSpiClk = BSP_EXTENSIONPORT_GPIO_PB5; /* SPI1 clock pin */
    if (NULL == Bsp_ExtensionPortSpiHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_SPI_NOT_CONNECTED));
    }
    retVal = SetSpiOwnership(BSP_EXTENSIONPORT_RESET_STATE);
    if (retVal == RETCODE_OK)
    {
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiMosi].Port,BSP_ExtensionPortTable[pinIdSpiMosi].Pin, gpioModeDisabled,0);
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiMiso].Port,BSP_ExtensionPortTable[pinIdSpiMiso].Pin, gpioModeDisabled,0);
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdSpiClk].Port,BSP_ExtensionPortTable[pinIdSpiClk].Pin, gpioModeDisabled,0);
        CMU_ClockEnable(cmuClock_USART2, true);
        Bsp_ExtensionPortSpiHandle->Instance->ROUTE = _USART_ROUTE_RESETVALUE;
        Bsp_ExtensionPortSpiHandle->Instance = NULL;
        CMU_ClockEnable(cmuClock_USART2, false);
        Bsp_ExtensionPortSpiHandle = NULL;
    }
    return retVal;
}

