eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
/*
 * Refer interface description available in BspExtensionPort.h
 */
void BSP_ExtensionPort_SpiRxIsr(void)
{
    Retcode_T retVal = RETCODE_OK;
    if ((NULL != Bsp_ExtensionPortSpiRxIsrCb) && (NULL != Bsp_ExtensionPortSpiHandle))
    {
        /* All SPI interrupt processing is to be done at the MCU level */
        Bsp_ExtensionPortSpiRxIsrCb((SPI_T) Bsp_ExtensionPortSpiHandle);
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER);
        Retcode_RaiseErrorFromIsr(retVal);
    }
}

/*
 * Refer interface description available in BspExtensionPort.h
 */
void BSP_ExtensionPort_SpiTxIsr(void)
{
    Retcode_T retVal = RETCODE_OK;
    if ((NULL != Bsp_ExtensionPortSpiTxIsrCb) && (NULL != Bsp_ExtensionPortSpiHandle))
    {
        /* All SPI interrupt processing is to be done at the MCU level */
        Bsp_ExtensionPortSpiTxIsrCb((SPI_T) Bsp_ExtensionPortSpiHandle);
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER);
        Retcode_RaiseErrorFromIsr(retVal);
    }
}

/*
 * Refer to interface header for description
 */

HWHandle_T BSP_ExtensionPort_GetUartHandle(void)
{
    HWHandle_T Handle = (HWHandle_T) Bsp_ExtensionPortUartHandle;
    return Handle;
}

/*
 * Refer to interface header for description
 */

Retcode_T BSP_ExtensionPort_ConnectUart(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdTx, pinIdRx;

    pinIdTx = BSP_EXTENSIONPORT_GPIO_PB9; /*Tx pin */
    pinIdRx = BSP_EXTENSIONPORT_GPIO_PB10; /*Rx pin */

    retVal = IsUartPortAvailable();
    if (RETCODE_OK == retVal)
    {
        retVal = SetUartOwnership(BSP_EXTENSIONPORT_PIN_USEDBY_UART);
        if (RETCODE_OK == retVal)
        {
            Bsp_ExtensionPortUartInstance.Uart_ptr = UART1;
            Bsp_ExtensionPortUartInstance.TransferMode = BCDS_HAL_TRANSFER_MODE_INTERRUPT;
            GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdTx].Port, BSP_ExtensionPortTable[pinIdTx].Pin, gpioModeDisabled, 0);
            GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdRx].Port, BSP_ExtensionPortTable[pinIdRx].Pin, gpioModeDisabled, 0);
            Bsp_ExtensionPortUartHandle = &Bsp_ExtensionPortUartInstance;
        }
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */

Retcode_T BSP_ExtensionPort_DisonnectUart(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdTx, pinIdRx;
    pinIdTx = BSP_EXTENSIONPORT_GPIO_PB9; /*Tx pin */
    pinIdRx = BSP_EXTENSIONPORT_GPIO_PB10; /*Rx pin */
    if (NULL == Bsp_ExtensionPortUartHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_UART_NOT_CONNECTED));
    }
    retVal = SetUartOwnership(BSP_EXTENSIONPORT_RESET_STATE);
    if (RETCODE_OK == retVal)
    {
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdTx].Port, BSP_ExtensionPortTable[pinIdTx].Pin, gpioModeDisabled, 0);
        GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdRx].Port, BSP_ExtensionPortTable[pinIdRx].Pin, gpioModeDisabled, 0);

        /* Configure the Route for the UART */
        CMU_ClockEnable(cmuClock_UART1, true);
        (Bsp_ExtensionPortUartHandle->Uart_ptr)->ROUTE = _UART_ROUTE_RESETVALUE;
        Bsp_ExtensionPortUartHandle->Uart_ptr=NULL;
        CMU_ClockEnable(cmuClock_UART1, false);
        Bsp_ExtensionPortUartHandle=NULL;
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_SetUartConfig(BSP_ExtensionPortUartConfig_T configItem, uint32_t value, void * pvalue)
{
    BCDS_UNUSED(pvalue);
    Retcode_T retVal = RETCODE_OK;

    if (NULL == Bsp_ExtensionPortUartHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_UART_NOT_CONNECTED));
    }

    switch (configItem)
    {
        case BSP_EXTENSIONPORT_UART_BAUDRATE:
        if((UINT32_C(0) < value) && (UINT32_MAX > value))
        {
            /* Setting baudrate */
            Bsp_ExtensionPortUartHandle->Baudrate = (uint32_t) value;
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        }
        break;

        case BSP_EXTENSIONPORT_UART_PARITY:
        if(BSP_EXTENSIONPORT_UART_ODD_PARITY >= value)
        {
            /* Setting parity */
            Bsp_ExtensionPortUartHandle->Parity = (uint8_t)value;
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        }
        break;

        case BSP_EXTENSIONPORT_UART_STOPBITS:
        if(BSP_EXTENSIONPORT_UART_STOPBITS_TWO >= value)
        {
            /* Setting stopbits */
            Bsp_ExtensionPortUartHandle->Stopbits = (uint8_t)value;
        }
        else
        {
            retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        }
        break;

        default:
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_INVALID_PARAM);
        break;
    }
    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_EnableUart(void)
{
    Retcode_T retVal = RETCODE_OK;
    BSP_ExtensionPort_PinId_T pinIdTx, pinIdRx;
    pinIdTx = BSP_EXTENSIONPORT_GPIO_PB9; /*Tx pin */
    pinIdRx = BSP_EXTENSIONPORT_GPIO_PB10; /*Rx pin */

    /* Default configurations for the Usart Handle if the BSP_ExtensionPort_ConnectUart() is not called by user */
    USART_InitAsync_TypeDef UartInitializer =
    {   UART1_STATE, UART1_REF_FREQ, UART1_BAUDRATE, UART1_OVERSAMPLING, UART1_DATABITS,UART1_PARITY
        ,UART1_STOPBITS,UART1_MAJORITY_VOTING,UART1_PRS_RX_ENABLE,UART1_PRS_RX_CHANNEL};

    if (NULL == Bsp_ExtensionPortUartHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_UART_NOT_CONNECTED));
    }

    GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdRx].Port,
            BSP_ExtensionPortTable[pinIdRx].Pin, gpioModeInput,
            0);

    GPIO_PinModeSet(BSP_ExtensionPortTable[pinIdTx].Port,
            BSP_ExtensionPortTable[pinIdTx].Pin,gpioModePushPullDrive ,
            0);

