eclipse-archived/kiso/refcontexts/efm32/BSP/source/BSP_ExtensionPort.c
    /* check for parity and stopbits */
    switch(Bsp_ExtensionPortUartHandle->Parity)
    {
        case BSP_EXTENSIONPORT_UART_NO_PARITY:
        UartInitializer.parity = usartNoParity;
        break;
        case BSP_EXTENSIONPORT_UART_EVEN_PARITY:
        UartInitializer.parity = usartEvenParity;
        break;
        case BSP_EXTENSIONPORT_UART_ODD_PARITY:
        UartInitializer.parity = usartOddParity;
        break;
        default:
        break;
    }
    switch(Bsp_ExtensionPortUartHandle->Stopbits)
    {
        case BSP_EXTENSIONPORT_UART_STOPBITS_HALF:
            UartInitializer.stopbits = usartStopbits0p5;
        break;
        case BSP_EXTENSIONPORT_UART_STOPBITS_ONE:
            UartInitializer.stopbits = usartStopbits1;
        break;
        case BSP_EXTENSIONPORT_UART_STOPBITS_ONEANDAHALF:
            UartInitializer.stopbits = usartStopbits1p5;
        break;
        case BSP_EXTENSIONPORT_UART_STOPBITS_TWO:
            UartInitializer.stopbits = usartStopbits2;
        break;
        default:
        break;
    }

    UartInitializer.baudrate = Bsp_ExtensionPortUartHandle->Baudrate; /* Baud rate */
    CMU_ClockEnable(cmuClock_UART1, true);

    if (NULL != Bsp_ExtensionPortUartHandle->Uart_ptr)
    {
        USART_InitAsync(Bsp_ExtensionPortUartHandle->Uart_ptr, &UartInitializer);

        /* clear interrupt flags */
        Bsp_ExtensionPortUartHandle->Uart_ptr->IFC = _USART_IF_MASK;

        /* By default disable the interrupts, send/and or receive will take care  */
        Bsp_ExtensionPortUartHandle->Uart_ptr->IEN = 0;
        Bsp_ExtensionPortUartRxIsrCallback = Bsp_ExtensionPortUartHandle->IrqRxCallback;
        Bsp_ExtensionPortUartTxIsrCallback = Bsp_ExtensionPortUartHandle->IrqTxCallback;

        (Bsp_ExtensionPortUartHandle->Uart_ptr)->ROUTE = UART_ROUTE_RXPEN | UART_ROUTE_TXPEN | UART_ROUTE_LOCATION_LOC2;
        NVIC_SetPriority(UART1_RX_IRQn, EXTENSION_PORT_UART_RX_NVIC_PRIORITY);
        NVIC_SetPriority(UART1_TX_IRQn, EXTENSION_PORT_UART_TX_NVIC_PRIORITY);

        /*clear pending interrupts */
        NVIC_ClearPendingIRQ(UART1_RX_IRQn);
        NVIC_ClearPendingIRQ(UART1_TX_IRQn);

        /*enable interrupts */
        NVIC_EnableIRQ(UART1_RX_IRQn);
        NVIC_EnableIRQ(UART1_TX_IRQn);

        /* Enable the UART */
        USART_Enable(Bsp_ExtensionPortUartHandle->Uart_ptr, (USART_Enable_TypeDef) (USART_CMD_RXEN | USART_CMD_TXEN));
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_UART_MCU_IRQ_CALLBACK_NULL);
    }

    return retVal;
}

/*
 * Refer to interface header for description
 */
Retcode_T BSP_ExtensionPort_DisableUart(void)
{
    Retcode_T retVal = RETCODE_OK;
    if (NULL == Bsp_ExtensionPortUartHandle)
    {
        return (RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_BSP_EXTENSIONPORT_UART_NOT_CONNECTED));
    }
    NVIC_DisableIRQ(UART1_RX_IRQn);
    NVIC_DisableIRQ(UART1_TX_IRQn);
    Bsp_ExtensionPortUartRxIsrCallback = NULL;
    Bsp_ExtensionPortUartTxIsrCallback = NULL;
    (Bsp_ExtensionPortUartHandle->Uart_ptr)->CMD = USART_CMD_RXDIS | USART_CMD_TXDIS | USART_CMD_MASTERDIS;
    CMU_ClockEnable(cmuClock_UART1, BSP_DISABLE);
    return retVal;
}

/*
 * Refer description in the header file BspExtensionPort.h
 */
void BSP_ExtensionPort_UARTRxIsr(void)
{
    Retcode_T retVal = RETCODE_OK;
    if ((NULL != Bsp_ExtensionPortUartRxIsrCallback) && (NULL != Bsp_ExtensionPortUartHandle))
    {
        /* All UART interrupt processing is to be done at the MCU level */
        Bsp_ExtensionPortUartHandle->IrqRxCallback((UART_T) Bsp_ExtensionPortUartHandle);
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER);
        Retcode_RaiseErrorFromIsr(retVal);
    }
}

/*
 * Refer description in the header file BspExtensionPort.h
 */
void BSP_ExtensionPort_UARTTxIsr(void)
{
    Retcode_T retVal = RETCODE_OK;
    if ((NULL != Bsp_ExtensionPortUartTxIsrCallback) && (NULL != Bsp_ExtensionPortUartHandle))
    {
        /* All UART interrupt processing is to be done at the MCU level */
        Bsp_ExtensionPortUartHandle->IrqTxCallback((UART_T) Bsp_ExtensionPortUartHandle);
    }
    else
    {
        retVal = RETCODE(RETCODE_SEVERITY_ERROR, RETCODE_NULL_POINTER);
        Retcode_RaiseErrorFromIsr(retVal);
    }
}

#endif /* BCDS_FEATURE_BSP_EXTENSIONPORT */
